/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_printf.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: conteng <conteng@student.42seoul.kr>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/05/20 03:00:07 by conteng           #+#    #+#             */
/*   Updated: 2022/05/20 03:00:28 by conteng          ###   ########seoul.kr  */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"
#include <stdarg.h>

int ft_printf(const char *form, ...)
{
/*
    1. 문자열에서 %의 위치를 찾는다.
    2. 문자열에서 %뒤의 문자를 확인한다.
    3. 문자열에서 %뒤의 문자가 나타날때마다 문자를 출력.
    4. 문자열에서 
*/
}